<template>
  <div class="ecs">
    <div class="banner">
        <img src="./1.jpg" alt="">
      <div class="fiexdBox">
        <div class="top">
         <p class="title"> {{data.title}} </p>
         <p class="desc">
             弹性云上机 (ECS，Elastic Cloud Server) 是一种可随时获取、弹性可扩展的计算服务。云土机由 CPU、内存、镜像、云硬盘组成，同时结合VPC、安全组、数据多副本保存等能力，打造一个既高效又可靠安全的计算环境，确保服务持久稳定运行。
         </p>
          <el-button class="btn">立即开通</el-button>
          <el-button class="btnline">管理控制台</el-button>
          <el-button class="btnline">帮助文档</el-button>
        </div>
     </div>
    </div>
    <!-- 产品优势 -->
    <div class="ProductAdvantages">
        <div class="content">
            <div class="title">
                产品优势
            </div>
            <div class="cont">
                <div class="PAitem">
                    <svg t="1698912836580" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5115" width="200" height="200"><path d="M957.217391 86.372174C957.217391 86.372174 957.217391 608.211478 957.217391 608.211478 957.217391 639.510261 949.782261 670.630957 934.956522 701.573565 920.086261 732.605217 900.674783 762.568348 876.633043 791.685565 852.591304 820.758261 825.121391 848.317217 794.267826 874.273391 763.369739 900.274087 732.070957 923.425391 700.326957 943.727304 668.538435 964.073739 637.68487 980.992 607.721739 994.437565 577.758609 1007.88313 551.490783 1017.09913 528.918261 1022.130087 528.918261 1022.130087 518.233043 1024 518.233043 1024 518.233043 1024 508.438261 1022.130087 508.438261 1022.130087 485.286957 1017.09913 458.440348 1007.88313 427.853913 994.437565 397.267478 980.992 365.523478 964.073739 332.577391 943.727304 299.631304 923.425391 267.308522 900.274087 235.52 874.273391 203.776 848.317217 175.415652 820.758261 150.483478 791.685565 125.551304 762.568348 105.382957 732.605217 89.978435 701.573565 74.48487 670.630957 66.782609 639.510261 66.782609 608.211478 66.782609 608.211478 66.782609 86.372174 66.782609 86.372174 66.782609 86.372174 103.290435 80.717913 103.290435 80.717913 103.290435 80.717913 512.890435 0 512.890435 0 512.890435 0 930.504348 80.717913 930.504348 80.717913 930.504348 80.717913 957.217391 86.372174 957.217391 86.372174 957.217391 86.372174 957.217391 86.372174 957.217391 86.372174ZM513.024 75.553391C513.024 75.553391 508.082087 74.529391 508.082087 74.529391 508.082087 74.529391 156.538435 137.527652 156.538435 137.527652 156.538435 137.527652 156.538435 466.765913 156.538435 466.765913 156.538435 466.765913 513.024 466.765913 513.024 466.765913 513.024 466.765913 513.024 75.553391 513.024 75.553391 513.024 75.553391 513.024 75.553391 513.024 75.553391ZM867.461565 466.765913C867.461565 466.765913 513.024 466.765913 513.024 466.765913 513.024 466.765913 513.024 935.401739 513.024 935.401739 535.81913 929.881043 560.617739 921.466435 587.419826 910.113391 614.177391 898.760348 640.623304 885.359304 666.713043 869.865739 692.847304 854.372174 717.957565 837.186783 742.13287 818.265043 766.308174 799.343304 787.634087 778.99687 806.288696 757.314783 824.898783 735.677217 839.724522 713.149217 850.810435 689.730783 861.94087 666.35687 867.461565 642.582261 867.461565 618.496 867.461565 618.496 867.461565 466.765913 867.461565 466.765913 867.461565 466.765913 867.461565 466.765913 867.461565 466.765913Z" fill="#ac2807" p-id="5116"></path></svg>
                    <p>安全可靠</p>
                    <p>文字描述文字描述文字描述文字描述文字描述文字描述文字描述文字描述文字描述文字描述文字描述</p>
                </div>
                <div class="PAitem">
                    <svg t="1698912836580" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5115" width="200" height="200"><path d="M957.217391 86.372174C957.217391 86.372174 957.217391 608.211478 957.217391 608.211478 957.217391 639.510261 949.782261 670.630957 934.956522 701.573565 920.086261 732.605217 900.674783 762.568348 876.633043 791.685565 852.591304 820.758261 825.121391 848.317217 794.267826 874.273391 763.369739 900.274087 732.070957 923.425391 700.326957 943.727304 668.538435 964.073739 637.68487 980.992 607.721739 994.437565 577.758609 1007.88313 551.490783 1017.09913 528.918261 1022.130087 528.918261 1022.130087 518.233043 1024 518.233043 1024 518.233043 1024 508.438261 1022.130087 508.438261 1022.130087 485.286957 1017.09913 458.440348 1007.88313 427.853913 994.437565 397.267478 980.992 365.523478 964.073739 332.577391 943.727304 299.631304 923.425391 267.308522 900.274087 235.52 874.273391 203.776 848.317217 175.415652 820.758261 150.483478 791.685565 125.551304 762.568348 105.382957 732.605217 89.978435 701.573565 74.48487 670.630957 66.782609 639.510261 66.782609 608.211478 66.782609 608.211478 66.782609 86.372174 66.782609 86.372174 66.782609 86.372174 103.290435 80.717913 103.290435 80.717913 103.290435 80.717913 512.890435 0 512.890435 0 512.890435 0 930.504348 80.717913 930.504348 80.717913 930.504348 80.717913 957.217391 86.372174 957.217391 86.372174 957.217391 86.372174 957.217391 86.372174 957.217391 86.372174ZM513.024 75.553391C513.024 75.553391 508.082087 74.529391 508.082087 74.529391 508.082087 74.529391 156.538435 137.527652 156.538435 137.527652 156.538435 137.527652 156.538435 466.765913 156.538435 466.765913 156.538435 466.765913 513.024 466.765913 513.024 466.765913 513.024 466.765913 513.024 75.553391 513.024 75.553391 513.024 75.553391 513.024 75.553391 513.024 75.553391ZM867.461565 466.765913C867.461565 466.765913 513.024 466.765913 513.024 466.765913 513.024 466.765913 513.024 935.401739 513.024 935.401739 535.81913 929.881043 560.617739 921.466435 587.419826 910.113391 614.177391 898.760348 640.623304 885.359304 666.713043 869.865739 692.847304 854.372174 717.957565 837.186783 742.13287 818.265043 766.308174 799.343304 787.634087 778.99687 806.288696 757.314783 824.898783 735.677217 839.724522 713.149217 850.810435 689.730783 861.94087 666.35687 867.461565 642.582261 867.461565 618.496 867.461565 618.496 867.461565 466.765913 867.461565 466.765913 867.461565 466.765913 867.461565 466.765913 867.461565 466.765913Z" fill="#ac2807" p-id="5116"></path></svg>
                    <p>低代码灵活接入</p>
                    <p>文字描述文字描述文字描述文字描述文字描述文字描述文字描述文字描述文字描述文字描述文字描述</p>
                </div>
                <div class="PAitem">
                    <svg t="1698912836580" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5115" width="200" height="200"><path d="M957.217391 86.372174C957.217391 86.372174 957.217391 608.211478 957.217391 608.211478 957.217391 639.510261 949.782261 670.630957 934.956522 701.573565 920.086261 732.605217 900.674783 762.568348 876.633043 791.685565 852.591304 820.758261 825.121391 848.317217 794.267826 874.273391 763.369739 900.274087 732.070957 923.425391 700.326957 943.727304 668.538435 964.073739 637.68487 980.992 607.721739 994.437565 577.758609 1007.88313 551.490783 1017.09913 528.918261 1022.130087 528.918261 1022.130087 518.233043 1024 518.233043 1024 518.233043 1024 508.438261 1022.130087 508.438261 1022.130087 485.286957 1017.09913 458.440348 1007.88313 427.853913 994.437565 397.267478 980.992 365.523478 964.073739 332.577391 943.727304 299.631304 923.425391 267.308522 900.274087 235.52 874.273391 203.776 848.317217 175.415652 820.758261 150.483478 791.685565 125.551304 762.568348 105.382957 732.605217 89.978435 701.573565 74.48487 670.630957 66.782609 639.510261 66.782609 608.211478 66.782609 608.211478 66.782609 86.372174 66.782609 86.372174 66.782609 86.372174 103.290435 80.717913 103.290435 80.717913 103.290435 80.717913 512.890435 0 512.890435 0 512.890435 0 930.504348 80.717913 930.504348 80.717913 930.504348 80.717913 957.217391 86.372174 957.217391 86.372174 957.217391 86.372174 957.217391 86.372174 957.217391 86.372174ZM513.024 75.553391C513.024 75.553391 508.082087 74.529391 508.082087 74.529391 508.082087 74.529391 156.538435 137.527652 156.538435 137.527652 156.538435 137.527652 156.538435 466.765913 156.538435 466.765913 156.538435 466.765913 513.024 466.765913 513.024 466.765913 513.024 466.765913 513.024 75.553391 513.024 75.553391 513.024 75.553391 513.024 75.553391 513.024 75.553391ZM867.461565 466.765913C867.461565 466.765913 513.024 466.765913 513.024 466.765913 513.024 466.765913 513.024 935.401739 513.024 935.401739 535.81913 929.881043 560.617739 921.466435 587.419826 910.113391 614.177391 898.760348 640.623304 885.359304 666.713043 869.865739 692.847304 854.372174 717.957565 837.186783 742.13287 818.265043 766.308174 799.343304 787.634087 778.99687 806.288696 757.314783 824.898783 735.677217 839.724522 713.149217 850.810435 689.730783 861.94087 666.35687 867.461565 642.582261 867.461565 618.496 867.461565 618.496 867.461565 466.765913 867.461565 466.765913 867.461565 466.765913 867.461565 466.765913 867.461565 466.765913Z" fill="#ac2807" p-id="5116"></path></svg>
                    <p>降本增效</p>
                    <p>文字描述文字描述文字描述文字描述文字描述文字描述文字描述文字描述文字描述文字描述文字描述</p>
                </div>
                <div class="PAitem">
                    <svg t="1698912836580" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5115" width="200" height="200"><path d="M957.217391 86.372174C957.217391 86.372174 957.217391 608.211478 957.217391 608.211478 957.217391 639.510261 949.782261 670.630957 934.956522 701.573565 920.086261 732.605217 900.674783 762.568348 876.633043 791.685565 852.591304 820.758261 825.121391 848.317217 794.267826 874.273391 763.369739 900.274087 732.070957 923.425391 700.326957 943.727304 668.538435 964.073739 637.68487 980.992 607.721739 994.437565 577.758609 1007.88313 551.490783 1017.09913 528.918261 1022.130087 528.918261 1022.130087 518.233043 1024 518.233043 1024 518.233043 1024 508.438261 1022.130087 508.438261 1022.130087 485.286957 1017.09913 458.440348 1007.88313 427.853913 994.437565 397.267478 980.992 365.523478 964.073739 332.577391 943.727304 299.631304 923.425391 267.308522 900.274087 235.52 874.273391 203.776 848.317217 175.415652 820.758261 150.483478 791.685565 125.551304 762.568348 105.382957 732.605217 89.978435 701.573565 74.48487 670.630957 66.782609 639.510261 66.782609 608.211478 66.782609 608.211478 66.782609 86.372174 66.782609 86.372174 66.782609 86.372174 103.290435 80.717913 103.290435 80.717913 103.290435 80.717913 512.890435 0 512.890435 0 512.890435 0 930.504348 80.717913 930.504348 80.717913 930.504348 80.717913 957.217391 86.372174 957.217391 86.372174 957.217391 86.372174 957.217391 86.372174 957.217391 86.372174ZM513.024 75.553391C513.024 75.553391 508.082087 74.529391 508.082087 74.529391 508.082087 74.529391 156.538435 137.527652 156.538435 137.527652 156.538435 137.527652 156.538435 466.765913 156.538435 466.765913 156.538435 466.765913 513.024 466.765913 513.024 466.765913 513.024 466.765913 513.024 75.553391 513.024 75.553391 513.024 75.553391 513.024 75.553391 513.024 75.553391ZM867.461565 466.765913C867.461565 466.765913 513.024 466.765913 513.024 466.765913 513.024 466.765913 513.024 935.401739 513.024 935.401739 535.81913 929.881043 560.617739 921.466435 587.419826 910.113391 614.177391 898.760348 640.623304 885.359304 666.713043 869.865739 692.847304 854.372174 717.957565 837.186783 742.13287 818.265043 766.308174 799.343304 787.634087 778.99687 806.288696 757.314783 824.898783 735.677217 839.724522 713.149217 850.810435 689.730783 861.94087 666.35687 867.461565 642.582261 867.461565 618.496 867.461565 618.496 867.461565 466.765913 867.461565 466.765913 867.461565 466.765913 867.461565 466.765913 867.461565 466.765913Z" fill="#ac2807" p-id="5116"></path></svg>
                    <p>完善解决方案</p>
                    <p>文字描述文字描述文字描述文字描述文字描述文字描述文字描述文字描述文字描述文字描述文字描述</p>
                </div>
            </div>
        </div>
    </div>
    <!-- 产品特性 -->
    <div class="ProductCharacteristics">
        <div class="content">
            <div class="title">
                产品特性
            </div>
            <div class="cont">
                <div class="PCitem">
                    <p>自助配置资源</p>
                    <p>通过控制台创建空间，不同空间相互独立，支持自助删除空间，所占资源实时自动释放</p>
                </div>
                <div class="PCitem">
                    <p>空间按需分配</p>
                    <p>支持按需指定用户可用空间大小，使用过程中可随时扩容，允许原有数据在线无损转移</p>
                </div>
                <div class="PCitem">
                    <p>文件协同共享</p>
                    <p>支持指定用户灵活创建团队，团队内共享空间资源，支持用户间点对点共享和转存文件</p>
                </div>
                <div class="PCitem">
                    <p>分权分域管理</p>
                    <p>可自定义限制团队成员对共享空间文件的操作权限，有效控制企业敏感数据流转</p>
                </div>
                <div class="PCitem">
                    <p>目录式文件管理</p>
                    <p>提供目录式文件管理能力，支持复制、移动、重命名等操作，支持海量文件在在线检索</p>
                </div>
                <div class="PCitem">
                    <p>文件传输</p>
                    <p>网络传输稳定不限速，支持文件批量上传与下载，支持大文件传输启停及断点续传</p>
                </div>
            </div>
        </div>
    </div>
    <!-- 应用场景 -->
    <div class="ApplicationScenario">
        <div  class="content">
            <div class="title">
                应用场景
            </div>
            <div class="cont">
                <div class="top">
                    <div v-for="i in data2" :key="i.id" :class="activeIndex === i.id ? 'tiemActive' : 'item' " @click="changeTabs(i)">
                        {{i.title}}
                    </div>
                </div>
                <div class="bottom">
                    <div class="bottomCont">
                        <div class="left">
                        </div>
                        <div class="right">
                            <div class="right_top">
                                <p>客户场景</p>
                                <p>企业员工在日常办公过程中通常将文档或其他资料存放在个人设备中，硬件空间较小，无法存放日益增长的数据，若直接换新则成本过高，外挂便盘设备则带来额外麻烦，且普通存储设备可靠性低，长期使用后容易出现硬件故障，导致重要数据丢失</p>
                            </div>
                            <div class="right_footer">
                                <p>方案优势</p>
                                <p><svg t="1698995549700" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3992" width="200" height="200"><path d="M387.072 611.328L236.6464 460.8 128 569.3952l259.072 259.1232 515.1232-515.072L793.6 204.8z" fill="#d81e06" p-id="3993"></path></svg> 按需灵活扩展的存储空间，一键扩容，实时生效</p>
                                <p><svg t="1698995549700" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3992" width="200" height="200"><path d="M387.072 611.328L236.6464 460.8 128 569.3952l259.072 259.1232 515.1232-515.072L793.6 204.8z" fill="#d81e06" p-id="3993"></path></svg> 目录式文件管理，支持复制移动等多种文件操作，贴近系统原生体验</p>
                                <p><svg t="1698995549700" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3992" width="200" height="200"><path d="M387.072 611.328L236.6464 460.8 128 569.3952l259.072 259.1232 515.1232-515.072L793.6 204.8z" fill="#d81e06" p-id="3993"></path></svg> 多种平台接入SDK，便于各种设备快速接入和备份数据，防止丢失</p>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
    <!-- 帮助文档 -->
    <div class="Documents">
        <div class="title">
            <p>帮助文档</p>
            <p>前往文档中心 > </p>
        </div>
        <div class="bottom">
          <div class="doc">
              <div class="top">
                 <span> <svg t="1699181976578" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4323" id="mx_n_1699181976579" width="200" height="200"><path d="M288 320h448a32 32 0 0 0 0-64H288a32 32 0 0 0 0 64zM288 544h448a32 32 0 0 0 0-64H288a32 32 0 0 0 0 64zM544 704H288a32 32 0 0 0 0 64h256a32 32 0 0 0 0-64z" p-id="4324" fill="#1684FF"></path><path d="M896 132.928C896 77.28 851.552 32 796.928 32H227.04C172.448 32 128 77.28 128 132.928v758.144C128 946.72 172.448 992 227.04 992h435.008c1.568 0 2.912-0.672 4.416-0.896 8.96 1.6 18.464-0.256 25.984-6.528l192-160a31.424 31.424 0 0 0 10.816-27.2c0.16-1.184 0.736-2.208 0.736-3.424V132.928zM192 891.072V132.928C192 112.576 207.712 96 227.04 96h569.888C816.288 96 832 112.576 832 132.928V736h-96a96 96 0 0 0-96 96v96H227.04C207.712 928 192 911.424 192 891.072zM814.016 800L704 891.68V832a32 32 0 0 1 32-32h78.016z" p-id="4325" fill="#1684FF"></path></svg><span style="marginLeft:15px">服务帮助</span></span>
                  <span style="fontSize:12px;fontWeight:1;marginTop:5px;marginRight:20px;">查看更多</span>
              </div>
              <div class="doc_footer">
                  <p>什么是云空间？</p>
                  <p>云空间支持哪些功能？</p>
                  <p>云空间有哪些优势？</p>
              </div>
          </div>
          <div class="doc">
              <div class="top">
                 <span> <svg t="1699181976578" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4323" id="mx_n_1699181976579" width="200" height="200"><path d="M288 320h448a32 32 0 0 0 0-64H288a32 32 0 0 0 0 64zM288 544h448a32 32 0 0 0 0-64H288a32 32 0 0 0 0 64zM544 704H288a32 32 0 0 0 0 64h256a32 32 0 0 0 0-64z" p-id="4324" fill="#1684FF"></path><path d="M896 132.928C896 77.28 851.552 32 796.928 32H227.04C172.448 32 128 77.28 128 132.928v758.144C128 946.72 172.448 992 227.04 992h435.008c1.568 0 2.912-0.672 4.416-0.896 8.96 1.6 18.464-0.256 25.984-6.528l192-160a31.424 31.424 0 0 0 10.816-27.2c0.16-1.184 0.736-2.208 0.736-3.424V132.928zM192 891.072V132.928C192 112.576 207.712 96 227.04 96h569.888C816.288 96 832 112.576 832 132.928V736h-96a96 96 0 0 0-96 96v96H227.04C207.712 928 192 911.424 192 891.072zM814.016 800L704 891.68V832a32 32 0 0 1 32-32h78.016z" p-id="4325" fill="#1684FF"></path></svg><span style="marginLeft:15px">操作帮助</span></span>
                  <span style="fontSize:12px;fontWeight:1;marginTop:5px;marginRight:20px;">查看更多</span>
              </div>
              <div class="doc_footer">
                  <p>云空间如何计费？</p>
                  <p>如何管理空间字用户？</p>
                  <p>如何使用群组共享空间？</p>
              </div>
          </div>
          <div class="doc">
              <div class="top">
                 <span> <svg t="1699181976578" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4323" id="mx_n_1699181976579" width="200" height="200"><path d="M288 320h448a32 32 0 0 0 0-64H288a32 32 0 0 0 0 64zM288 544h448a32 32 0 0 0 0-64H288a32 32 0 0 0 0 64zM544 704H288a32 32 0 0 0 0 64h256a32 32 0 0 0 0-64z" p-id="4324" fill="#1684FF"></path><path d="M896 132.928C896 77.28 851.552 32 796.928 32H227.04C172.448 32 128 77.28 128 132.928v758.144C128 946.72 172.448 992 227.04 992h435.008c1.568 0 2.912-0.672 4.416-0.896 8.96 1.6 18.464-0.256 25.984-6.528l192-160a31.424 31.424 0 0 0 10.816-27.2c0.16-1.184 0.736-2.208 0.736-3.424V132.928zM192 891.072V132.928C192 112.576 207.712 96 227.04 96h569.888C816.288 96 832 112.576 832 132.928V736h-96a96 96 0 0 0-96 96v96H227.04C207.712 928 192 911.424 192 891.072zM814.016 800L704 891.68V832a32 32 0 0 1 32-32h78.016z" p-id="4325" fill="#1684FF"></path></svg><span style="marginLeft:15px">常见问题</span></span>
                  <span style="fontSize:12px;fontWeight:1;marginTop:5px;marginRight:20px;">查看更多</span>
              </div>
              <div class="doc_footer">
                  <p>上传下载是否有限速？</p>
                  <p>资源包与空间的关系？</p>
                  <p>云空间与对象存储有何不同？</p>
              </div>
          </div>
        </div>
    </div>
    <!-- 右侧悬浮框 -->
    <FixedBoxVue :ToolTitle='`联系我们`' :ToolContent='`400-113-2111`' :ToolTitle2='`智能客服`' :ToolContent2='`尽心为您服务`' :disabled='false'>
      <template v-slot:top>
        <svg t="1696924023070" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4173" width="50000" height="50000"><path d="M647.786667 845.397333c-76.053333-24.234667-157.248-76.266667-240.917334-163.648-81.152-84.757333-131.626667-164.864-157.504-238.442666-16.832-47.829333-21.056-85.546667-18.581333-111.402667a50.986667 50.986667 0 0 1 0.384-3.221333l0.341333-3.349334c0.469333-18.112 10.922667-46.144 22.122667-59.264a414.677333 414.677333 0 0 1 34.56-39.466666c9.834667-9.877333 19.306667-18.133333 27.946667-24.192 12.885333-9.045333 21.162667-11.328 23.317333-10.069334-0.213333 0.021333 1.045333 1.322667 2.837333 3.776 3.157333 4.288 7.082667 10.517333 11.669334 18.410667a1030.4 1030.4 0 0 1 31.04 59.264 3473.109333 3473.109333 0 0 1 58.368 126.229333c1.706667 3.84 0.938667 12.309333-1.344 15.722667l-47.04 69.824a27.52 27.52 0 0 0-3.370667 7.424c-7.509333 25.92 12.309333 66.517333 73.834667 129.216 37.504 38.186667 70.293333 63.061333 98.496 77.077333 18.944 9.429333 33.28 12.8 42.730666 12.586667 4.48-0.192 8.256-1.450667 11.52-3.626667l69.546667-46.933333c3.584-2.410667 12.416-3.349333 16.533333-1.685333l8.704 3.477333a3178.794667 3178.794667 0 0 1 91.477334 38.464c7.04 3.114667 13.802667 6.144 20.266666 9.088 21.76 9.962667 39.637333 18.773333 52.629334 25.984 6.784 3.797333 12.074667 7.061333 15.573333 9.642667 1.429333 1.066667 2.432 1.877333 2.901333 2.346666a10.602667 10.602667 0 0 1-2.197333-3.968l1.472 3.2c4.522667 8.064-16.853333 38.122667-51.562667 68.714667a626.624 626.624 0 0 1-20.544 17.344 21.333333 21.333333 0 1 0 26.453334 33.450667 669.056 669.056 0 0 0 22.293333-18.794667c52.48-46.293333 80.661333-85.866667 60.544-121.642667l1.472 3.2c-6.037333-16.64-32.277333-31.274667-91.306667-58.261333-6.613333-3.050667-13.546667-6.144-20.736-9.322667a2876.629333 2876.629333 0 0 0-101.610666-42.538666c-17.109333-6.912-40.874667-4.416-56.234667 5.930666l-69.546667 46.933334 10.922667-3.626667c0.576-0.021333-0.554667-0.149333-2.986667-0.725333a92.693333 92.693333 0 0 1-19.306666-7.424c-23.68-11.776-52.693333-33.792-87.04-68.778667-51.797333-52.757333-65.322667-80.490667-63.317334-87.445333a16.021333 16.021333 0 0 1-1.92 4.074666l46.741334-69.376c10.474667-15.573333 12.586667-39.530667 5.013333-56.725333l-4.138667-9.365333a3937.258667 3937.258667 0 0 0-46.122666-100.202667c-3.029333-6.293333-5.973333-12.416-8.874667-18.304-30.997333-63.082667-48.512-93.290667-64.213333-100.48-18.922667-11.157333-42.261333-4.672-67.456 12.992-10.922667 7.658667-22.186667 17.472-33.642667 28.970667a456.597333 456.597333 0 0 0-37.610667 42.88c-16.853333 19.712-30.805333 57.173333-31.509333 84.906666l0.341333-3.349333c-0.277333 1.493333-0.597333 3.797333-0.896 6.954667-3.050667 31.893333 1.877333 75.818667 20.821334 129.621333 27.946667 79.466667 81.664 164.736 166.912 253.781333 88.490667 92.416 175.765333 148.330667 258.773333 174.805334 27.797333 8.853333 53.888 13.952 77.973333 15.957333a21.333333 21.333333 0 0 0 3.52-42.517333 310.570667 310.570667 0 0 1-68.522666-14.08z" fill="#3D3D3D" p-id="4174"></path></svg>
      </template>
      <template v-slot:bottom >
        111
      </template>
      <template v-slot:backtop>
        回顶
      </template>
    </FixedBoxVue>
  </div>
</template>

<script>
import FixedBoxVue from '../components/FixedBox.vue'
export default {
  name: 'Ecs',
  props: {},
  components: {
    FixedBoxVue
  },
  data() {
    return {
      data: [],
      data2: [
        {
          id: 1,
          title: '文件备份与管理'
        },
        {
          id: 2,
          title: '协同办公'
        },
        {
          id: 3,
          title: '数据安全防护'
        }
      ],
      activeIndex: 1
    }
  },
  mounted() {
    const _this = this
    _this.data = JSON.parse(localStorage.getItem('DescData'))
    window.addEventListener('scroll', this.handleFun)
  },
  methods: {
    changeTabs(item) {
      this.activeIndex = item.id
    },
    handleFun() {
      const scrollTop = window.scrollTop || document.documentElement.scrollTop || document.body.scrollTop
    }
  }
}
</script>

<style lang="less" scoped>
.ecs{
    background: white;
    .icon{
        height: 5em;
        width: 4em;
        margin-top: 30px;
    }
    .banner{
  position: relative;
  width: 100%;
  height: 400px;
  min-width: 1500px;
  img{
    width: 100%;
    height: 100%;
  }
}
.ProductAdvantages{
    width: 100%;
    border-bottom: 2px solid #949494;
    padding-bottom: 100px;
    .content{
        width: 85%;
        height: 100%;
        margin-left: 7.5%;
        .title{
            min-width: 1285px;
            height: 100px;
            line-height: 100px;
            font-size: 30px;
            letter-spacing: 1px;
            font-weight: bold;
            text-align: center;
            margin-top: 10px;
        }
        .cont{
            height: 500px;
            width: 100%;
            min-width: 1285px;
            display: flex;
            flex-wrap: wrap;
            justify-content: space-around;
            align-content: space-around;
            .PAitem{
                background: rgb(244, 246, 248);
                transition: box-shadow 0.3s linear;
                height: 45%;
                width: 48%;
                margin-left: 1%;
                text-align: center;
                p:nth-child(2){
                    font-weight: bold;
                    font-size: 17px;
                    margin-top: 5px;
                }
                p:nth-child(3){
                    width: 70%;
                    margin-left: 15%;
                    min-width: 400px;
                    height: 50px;
                    font-size: 13px;
                    margin-top: 20px;
                    text-align: left;
                    line-height: 20px;
                }
            }
            .PAitem:hover{
                transform: translateY(-5px);
                transition: box-shadow 0.3s linear,transform 0.2s linear;
                box-shadow: 0px 3px 5px 0px rgba(0, 0, 0, 0.5)
            }
        }
    }
}
.ProductCharacteristics{
    width: 100%;
    border-bottom: 2px solid #949494;
    padding-bottom: 50px;
    .content{
        width: 85%;
        height: 100%;
        margin-left: 7.5%;
        .title{
            min-width: 1285px;
            height: 100px;
            line-height: 100px;
            font-size: 30px;
            letter-spacing: 1px;
            font-weight: bold;
            text-align: center;
            margin-top: 20px;
        }
        .cont{
            height: 500px;
            width: 100%;
            min-width: 1285px;
            display: flex;
            flex-wrap: wrap;
            justify-content: space-around;
            align-content: space-around;
            .PCitem{
                width: 29%;
                height: 40%;
                margin-left: 10px;
                border: 2px solid #1684FF;
                border-radius: 5px;
                p:nth-child(1){
                    font-weight: bolder;
                    font-size: 20px;
                    margin-top: 45px;
                    width: 70%;
                    margin-left: 15%;
                }
                p:nth-child(2){
                    width: 70%;
                    margin-left: 15%;
                    font-size: 14px;
                    margin-top: 20px;
                    letter-spacing: 2px;
                    line-height: 20px;
                }
            }
        }
    }
}
.ApplicationScenario{
  width: 100%;
  padding-bottom: 80px;
  border-bottom: 2px solid #949494;
   .content{
        width: 85%;
        height: 100%;
        margin-left: 7.5%;
        .title{
            min-width: 1285px;
            height: 100px;
            line-height: 100px;
            font-size: 30px;
            letter-spacing: 1px;
            font-weight: bold;
            text-align: center;
            margin-top: 20px;
        }
        .top{
            margin-top: 10px;
            min-width: 1250px;
            width: 100%;
            display: flex;
            height: 50px;
            justify-content: center;
            // overflow: hidden;
            // text-overflow: ellipsis;
            white-space: nowrap;
            .item{
                font-size: 17px;
                cursor: pointer;
                margin: 0px 170px;
                height: 25px;
            }
            .tiemActive{
                font-size: 17px;
                cursor: pointer;
                margin: 0px 170px;
                height: 25px;
                color: #ac2807;
                position: relative;
            }
             .tiemActive:after{
                background: #ac2807;
                position: absolute;
                left: 50%;
                height: 4px;
                bottom: 0;
                top: 25px;
                width: 100%;
                content: "";
                transform:translateX(-50%);
                animation: changeSize 0.3s 1;
            }
            @keyframes changeSize {
                from{
                    width:0%
                }
                to{
                    width: 100%;
                }
            }
        }
        .bottom{
            height: 600px;
            border: 3px solid #e2e5e3;
            width: 100%;
            display: flex;
            min-width: 1250px;
            .bottomCont{
                width: 100%;
                padding: 25px 35px;
                display: flex;
                .left{
                    width: 50%;
                    height: 100%;
                    background: rgb(245, 245, 245);
                    background-image: url('./2.png');
                    //保证图片不变形
                    background-size: contain;
                    background-repeat: no-repeat;
                    background-position: center;
                }
                .right{
                    width: 45%;
                    margin-left: 4%;
                    height: 100%;
                    .right_top{
                        height: 40%;
                        width: 100%;
                        border-bottom: 2px solid #e2e5e3;
                        display: block;
                        p:nth-child(1){
                            float: left;
                            font-weight: bold;
                            font-size: 20px;
                            margin-top: 20px;
                        }
                        p:nth-child(2){
                            float: left;
                            font-size: 16px;
                            display: block;
                            line-height: 20px;
                            letter-spacing: 1px;
                            margin-top: 50px;
                        }
                    }
                    .right_footer{
                        height: 60%;
                        width: 100%;
                        .icon{
                            width: 1.2em;
                            height: 1.2em;
                            margin-top: 10px;
                        }
                        p:nth-child(1){
                            font-weight: bold;
                            font-size: 20px;
                            margin-top: 30px;
                        }
                        p:nth-child(2){
                            float: left;
                            font-size: 16px;
                            display: block;
                            letter-spacing: 1px;
                            margin-top: 50px;
                        }
                        p:nth-child(3){
                            float: left;
                            font-size: 16px;
                            display: block;
                            letter-spacing: 1px;
                            margin-top: 5px;
                        }
                        p:nth-child(4){
                            float: left;
                            font-size: 16px;
                            display: block;
                            letter-spacing: 1px;
                            margin-top: 5px;
                        }
                    }
                }
            }
        }
   }
}
.Documents{
    height: 420px;
    background: white;
    min-width: 1485px;
    margin-bottom: 50px;
    .title{
        text-align: center;
        height: 100px;
        p:nth-child(1){
            line-height: 100px;
            font-size: 30px;
            font-weight: bold;
            letter-spacing: 1px;
        }
        p:nth-child(2){
            cursor: pointer;
            font-size: 13px;
            color: #ac2807;
            font-weight: bold;
        }
    }
    .bottom{
        width: 85%;
        height: 220px;
        margin-top: 100px;
        margin-left: 7.5%;
        display: flex;
        justify-content: space-between;
        .doc{
            height: 100%;
            width: 30%;
            border-radius: 2px;
            box-shadow: 0 2px 4px rgba(0, 0, 0, .32), 0 0 6px rgba(0, 0, 0, .14);
            .top{
                height: 30%;
                display: flex;
                font-weight: bold;
                font-size: 20px;
                letter-spacing: 1px;
                justify-content:space-between;
                align-items: center;
                .icon{
                    height: 1.1em;
                    width: 1.1em;
                    margin-top: 2px;
                    float: left;
                    margin-left: 20px;
                }
            }
            .doc_footer{
                height: 65%;
                width: 90%;
                margin-left: 5%;
                font-size: 13px;
                p:nth-child(1){
                    cursor: pointer;
                    width: 100%;
                    height: 45px;
                    line-height: 45px;
                    border-bottom: 1px solid #afafaf;
                }
                p:nth-child(2){
                    cursor: pointer;
                    width: 100%;
                    height: 45px;
                    line-height: 45px;
                    border-bottom: 1px solid #afafaf;
                }
                p:nth-child(3){
                    cursor: pointer;
                    width: 100%;
                    height: 45px;
                    line-height: 45px;
                }
            }
        }
    }
}
.fiexdBox{
  min-width: 200px;
  position: absolute;
  height: 200px;
  width: 40%;
  top: 50px;
  left: 5%;
  .top{
    position: relative;
    margin-top: 50px;
    .box{
      position: absolute;
      width: 70%;
      height: 100px;
      background: white;
      top: 100px;
      z-index: 5;
    }
    .title{
      font-size: 40px;
      font-weight: bold;
      letter-spacing: 3px;
    }
    .desc{
        font-size: 14px;
        color: black;
        margin-top: 20px;
        line-height: 22px;
    }
    .btn{
        height: 40px;
        width: 120px;
        font-weight: bold;
        background: #ac2807;
        font-size: 14px;
        border: 1px solid #ac2807;
        color: white;
        margin-top: 30px;
        border-radius: 5px;
    }
    .btn:hover{
        background: #d6350d;
    }
    .btnline{
        font-weight: bold;
        height: 40px;
        width: 120px;
        background: none;
        border: 1px solid #ac2807;
        font-size: 14px;
        color: #ac2807;
        margin-top: 30px;
        border-radius: 5px;
        margin-left: 20px;
    }
    .btnline:hover{
        background: white;
    }
  }
}
}
</style>
